### Limpieza de datos

In [3]:
import pandas as pd

In [2]:
df = pd.read_csv("vgsales.csv")

df.shape

(16598, 11)

In [4]:
df.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

### Ver si hay valores faltantes

In [5]:
valores_faltantes = df.isnull().sum()

valores_faltantes

Rank              0
Name              0
Platform          0
Year            271
Genre             0
Publisher        58
NA_Sales          0
EU_Sales          0
JP_Sales          0
Other_Sales       0
Global_Sales      0
dtype: int64

In [6]:
# En la columna publisher hay 58 datos faltantes y en la columna year 271, 
# como "solo" son 58 en la columna Publisher se eliminaran, mientras que en
# la columna Year hay casi 300 valores faltantes, se hara una imputacion con la media.

filas_con_faltantes = df[df.isnull().any(axis=1)]
filas_con_faltantes.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
179,180,Madden NFL 2004,PS2,NaN,Sports,Electronic Arts,4.26,0.26,0.01,0.71,5.23
377,378,FIFA Soccer 2004,PS2,NaN,Sports,Electronic Arts,0.59,2.36,0.04,0.51,3.49
431,432,LEGO Batman: The Videogame,Wii,NaN,Action,Warner Bros. Interactive Entertainment,1.86,1.02,0.00,0.29,3.17
470,471,wwe Smackdown vs. Raw 2006,PS2,NaN,Fighting,NaN,1.57,1.02,0.00,0.41,3.00
607,608,Space Invaders,2600,NaN,Shooter,Atari,2.36,0.14,0.00,0.03,2.53

In [7]:
df = df.dropna(subset=['Publisher'])

df['Year'] = df['Year'].fillna(df['Year'].mean())

In [8]:
valores_faltantes = df.isnull().sum()

valores_faltantes

Rank            0
Name            0
Platform        0
Year            0
Genre           0
Publisher       0
NA_Sales        0
EU_Sales        0
JP_Sales        0
Other_Sales     0
Global_Sales    0
dtype: int64

In [9]:
df.shape

(16540, 11)

In [10]:
duplicados = df.duplicated()
print(duplicados.sum())

0

### Exportar el dataset ya limpio

In [106]:
df.to_csv('dataset_limpio.csv', index=False)